{"name":"pyload","version":"1.4.0","description":"Installs/Configures Pyload","long_description":"# Pyload Cookbook\n\n[![Build Status](https://travis-ci.org/gridtec/cookbook-pyload.svg?branch=master)](https://travis-ci.org/gridtec/cookbook-pyload)\n[![License](https://img.shields.io/badge/license-Apache_2-blue.svg)](https://www.apache.org/licenses/LICENSE-2.0)\n[![Cookbook Version](https://img.shields.io/cookbook/v/pyload.svg)](https://supermarket.chef.io/cookbooks/pyload)\n\nThis cookbook is used to install and configure [Pyload](https://github.com/pyload/pyload) on a system. Just put it in your nodes `run_list` or include the default recipe using `include_recipe`. This cookbook installs Pyload from its Git repository regarding the version tag or branch you've configured, installs all required dependencies for Pyload, prepares configuration folder and files and installs the appropriate configuration for your platform's init system.\n\n## Requirements\n\n### Platforms\n\n* ArchLinux\n* CentOS 6+\n* Debian 7+\n* Fedora 22+\n* FreeBSD 10+\n* openSUSE 13+\n* RHEL 6+\n* Ubuntu 12.04+\n\n### Chef\n\nChef 12.5+\n\n### Cookbooks\n\nThis cookbook has no direct external dependencies.\n\nRegarding your OS, you may need additional recipes or cookbooks for this cookbook's recipes to converge on the node. In particular, the following things should be considered.\n\n* On Debian/Ubuntu, use the [apt](https://github.com/chef-cookbooks/apt) cookbook to ensure the package cache is updated so Chef can install packages, or consider putting apt-get in your bootstrap process or knife bootstrap template. Otherwise this cookbook won't install latest versions of Pyload dependencies using sysem package manager (apt).\n* On Red Hat Enterprise Linux (RHEL) and derivatives, some 3rd party repositories may be necessary to be installed and enabled in yum to install required packages/dependencies for Pyload used in certain recipes of this cookbook. The [yum](https://github.com/chef-cookbooks/yum) and [yum-epel](https://github.com/chef-cookbooks/yum-epel) cookbooks are therefore suggested to be in your `run_list`.\n\n## Attributes\n\nThe attributes used by this cookbook are in the `node['pyload']` namespace which is broken up into different groups.\n\n### Cookbook Settings\n\nThe `node['pyload']` global namespace defines general settings for this cookbook.\n\n* `node['pyload']['version']` - Specifies the version to install. By default, this is set to *stable*.\n* `node['pyload']['install_dir']` - Specifies the location for Pyload package itself. By default, this is set to */usr/share/pyload*.\n* `node['pyload']['config_dir']` - Specifies the location for Pyload configuration folders and files. By default, this is set to */home/&lt;user&gt;/.pyload* (interpolates to */home/pyload/.pyload* if defaults are used).\n* `node['pyload']['download_dir']` - Specifies the location for all Pyload downloaded files. By default, this is set to *node['pyload']['config_dir']/downloads* (interpolates to */home/pyload/.pyload/downloads* if defaults are used).\n* `node['pyload']['log_dir']` - Specifies the location where log files will be placed. By default, this is set to */var/log/pyload*.\n* `node['pyload']['pid_dir']` - Specifies the location of the PID file for Pyload. By default, this is set to */var/run/pyload*.\n* `node['pyload']['user']` - Specifies the user which is used to run Pyload. By default, this is set to *pyload*.\n* `node['pyload']['group']` - Specifies the group which is used to run Pyload. By default, this is set to *pyload*.\n* `node['pyload']['dir_mode']` - Specifies the mode for folders created by this cookbook. By default, this is set to *0755*.\n* `node['pyload']['file_mode']` - Specifies the mode for files created by this cookbook. By default, this is set to *0644*.\n* `node['pyload']['init_style']` - Specifies the platforms init system type which can be either set to `bsd`, `init`, `systemd` or `upstart`. If something else is specified, no install script will be created. By default, the correct init system type is determined by this cookbook itself, which means that this attribute should not be required to be set manually.\n* `node['pyload']['python_exec']` - Specifies the platforms Python executable (interpreter) used to run Pyload. By default, the correct Python executable is determined by this cookbook itself regarding your platform, which means that this attribute should not be required to be set manually.\n* `node['pyload']['packages']` - Specifies a list of dependencies of Pyload which are required to successfully start Pyload. The correct package names are determined by this cookbook, regarding platform and platfom version. By default, this is set to all required dependencies for Pyload, including optional ones, which can be examined at Pyload repository or in the corresponding attribute file of this cookbook.\n* `node['pyload']['accounts']` - Specifies all accounts to be configured for Pyload. The value is expected to be a hash which includes one or multiple ids representing an account whereas each id has a subhash as value representing the account data. The subhash should have the following content:\n  * `user` - The name of the user which identifies the account. Required.\n  * `password` - The password of the user which identifies the account. Required.\n  * `name` - The name for the account. If unset, the account id will be used, so this is optional.\n\n  The following example demonstrates the use of this attribute:\n  ```ruby\n    accounts = {\n      ftp: {\n        user: 'root',\n        password: 'changeme',\n        name: 'Ftp'\n      }\n    }\n  ```\n\n### General Settings\n\nThe `node['pyload']` global namespace also defines the following general settings for Pyload, which will be set in *pyload.conf* configuration file.\n\n* `node['pyload']['language']` - Specifies Pyload language. Allowed values are `en`, `de`, `fr`, `it`, `es`, `nl`, `sv`, `ru`, `pl`, `cs`, `sr`, `pt_BR`. If something else is specified, Pyload may not start. By default, this is set to *en*.\n* `node['pyload']['debug_mode']` - Specifies if Pyload should be started in debug mode. By default, this is set to *false*.\n* `node['pyload']['min_free_space']` - Specifies the minimum of free space required in the downloads location (specified in `node['pyload']['download_dir']`) in MB. By default, this is set to *200*.\n* `node['pyload']['folder_per_package']` - Specifies if each download should be saved in a folder in the downloads loation (specified in `node['pyload']['download_dir']`). By default, this is set to *true*.\n* `node['pyload']['cpu_priority']` - Specifies the CPU priority of the Pyload process. By default, this is set to *0*.\n* `node['pyload']['use_checksum']` - Specifies if Pyload should use checksums. By default, this is set to *false*.\n\n### Download Settings\n\nThe `node['pyload']['download']` namespace defines download settings for Pyload, which will be set in *pyload.conf* configuration file.\n\n* `node['pyload']['download']['bind_interface']` - Specifies the download interface to bind to, which can be represented by an interface name or an ip. If this is set to *None*, there is no specific binding defined. By default, this is set to *nil*.\n* `node['pyload']['download']['allow_ipv6']` - Specifies if IPv6 should be allowed. By default, this is set to *false*.\n* `node['pyload']['download']['max_connections']` - Specifies the maximum of connections for downloads. By default, this is set to *3*.\n* `node['pyload']['download']['max_downloads']` - Specifies the maximum of parallel downloads. By default, this is set to *3*.\n* `node['pyload']['download']['limit_speed']` - Specifies if the download speed should be limited. By default, the is no limit, which means that this is set to *false*.\n* `node['pyload']['download']['max_speed']` - Specifies the global, maximmum allowed speed. By default, there is no limit, which means that this is set to *-1*.\n* `node['pyload']['download']['skip_existing']` - Specifies if already downloaded files should be skipped, to avoid redownload. By default, this is set to *false*.\n* `node['pyload']['download']['start_time']` - Specifies the download start time in &lt;hour&gt;:&lt;min&gt; format. By default, this is set to *nil*.\n* `node['pyload']['download']['end_time']` - Specifies the download end time in &lt;hour&gt;:&lt;min&gt; format. By default, this is set to *nil*.\n\n### Logging Settings\n\nThe `node['pyload']['log']` namespace defines logging settings for Pyload, which will be set in *pyload.conf* configuration file.\n\n* `node['pyload']['log']['activated']` - Enables or disables logging. By default, this is enabled, which means that this is set to *true*.\n* `node['pyload']['log']['count']` - Specifies the maximum allowed logging files to keep, until they get deleted. By default, this is set to *5*.\n* `node['pyload']['log']['size']` - Specifies the maximum size of the log files in KB. By default, this is set to *100*.\n* `node['pyload']['log']['rotate']` - Specifies if logfiles should be rotated. This means, that the standard log file name represents the last logging output. By default, this is enabled, which means, that this is set to *true*.\n\n### Permission Settings\n\nThe `node['pyload']['permission']` namespace defines permissive settings for Pyload, which will be set in *pyload.conf* configuration file.\n\n* `node['pyload']['permission']['user']` - Specifies the username which will be used by Pyload. If set to *nil*, the value specified in `node['pyload']['user']` will be used. By default, this is set to *nil*.\n* `node['pyload']['permission']['group']` - Specifies the groupname which will be used by Pyload. If set to *nil*, the value specified in `node['pyload']['group']` will be used. By default, this is set to *nil*.\n* `node['pyload']['permission']['dir_mode']` - Specifies the directory mode which will be set for all downloads. By default, this is set to *0755*.\n* `node['pyload']['permission']['file_mode']` - Specifies the file mode which will be set for all downloads. By default, this is set to *0644*.\n* `node['pyload']['permission']['change_downloads']` - Specifies if the user and group of a downloaded package should be changed. By default, this is set to *false*.\n* `node['pyload']['permission']['change_file']` - Specifies if the file mode of a downloaded package should changed. By default, this is set to *false*.\n* `node['pyload']['permission']['change_user']` - Specifies if the user of the running process should be changed to the user specified in `node['pyload']['permission']['user']`. By default, this is set to *false*.\n* `node['pyload']['permission']['change_group']` - Specifies if the group of the running process should be changed to the group specified in `node['pyload']['permission']['group']`. By default, this is set to *false*.\n\n### Proxy Settings\n\nThe `node['pyload']['proxy']` namespace defines proxy settings for Pyload, which will be set in *pyload.conf* configuration file.\n\n* `node['pyload']['proxy']['activated']` - Enables or disables the use of a proxy. By default, this is disabled, which means that this is set to *false*.\n* `node['pyload']['proxy']['bind_address']` - Specifies the proxy address to bind to. By default, this is set to *localhost*.\n* `node['pyload']['proxy']['port']` - Specifies the proxy port to connect to. By default, this is set to *7070*.\n* `node['pyload']['proxy']['protocol']` - Specifies the proxy protocol used to connect to the proxy. Allowed values are `http`, `socks4` and `socks5`. By default, this is set to *http*.\n* `node['pyload']['proxy']['user']` - Specifies the user to authenticate at the proxy. By default, this is set to *nil*.\n* `node['pyload']['proxy']['password']` - Specifies the password of the user which authenticates at the proxy. By default, this is set to *nil*.\n\n### Reconnect Settings\n\nThe `node['pyload']['reconnect']` namespace defines reconnect settings for Pyload, which will be set in *pyload.conf* configuration file.\n\n* `node['pyload']['reconnect']['activated']` - Enables or disables the use of reconnects. By default, this is disabled, which means that this is set to *false*.\n* `node['pyload']['reconnect']['method']` - Specifies the reconnect method. By default, this is set to *nil*.\n* `node['pyload']['reconnect']['start_time']` - Specifies the reconnect start time in &lt;hour&gt;:&lt;min&gt; format. By default, this is set to *nil*.\n* `node['pyload']['reconnect']['end_time']` - Specifies the reconnect end time in &lt;hour&gt;:&lt;min&gt; format. By default, this is set to *nil*.\n\n### Remote Settings\n\nThe `node['pyload']['remote']` namespace defines remote API settings for Pyload, which will be set in *pyload.conf* configuration file.\n\n* `node['pyload']['remote']['activated']` - Enables or disables remote API. By default, this is enabled, which means that this is set to *true*.\n* `node['pyload']['remote']['listen_address']` - Specifies the address on which the remote API should listen on. By default, this is set to *0.0.0.0*.\n* `node['pyload']['remote']['port']` - Specifies the port for the remote API to connect to. By default, this is set to *7227*.\n* `node['pyload']['remote']['no_local_auth']` - Specifies if local connections to remote API does not require authentication. By default, local connections do not require authentication, which means that this is set to *true*.\n\n### SSL Settings\n\nThe `node['pyload']['ssl']` namespace defines SSL settings for Pyload, which will be set in *pyload.conf* configuration file.\n\n* `node['pyload']['ssl']['activated']` - Enables or disables SSL. By default, this is disabled, which means that this is set to *false*.\n* `node['pyload']['ssl']['cert']` - Specifies the SSL certificate path. By default, this is set to */etc/ssl/ssl.crt*.\n* `node['pyload']['ssl']['key']` - Specifies the SSL certificate key path. By default, this is set to */etc/ssl/ssl.key*.\n\n### Webinterface Settings\n\nThe `node['pyload']['webinterface']` namespace defines webinterface settings for Pyload, which will be set in *pyload.conf* configuration file.\n\n* `node['pyload']['webinterface']['activated']` - Enables or disables Pyload webinterface. By default, this is enabled, which means that this is set to *true*.\n* `node['pyload']['webinterface']['server_type']` - Specifies the webinterface server type. Allowed values are `builtin`, `threaded`, `fastcgi` and `lightweight`. More information on these types can be found in Pyload documentation. By default, this is set to *builtin*.\n* `node['pyload']['webinterface']['listen_address']` - Specifies the address on which the webinterface should listen on. By default, this is set to *0.0.0.0*.\n* `node['pyload']['webinterface']['port']` - Specifies the port for the webinterface to connect to. By default, this is set to *8080*.\n* `node['pyload']['webinterface']['template']` - Specifies the template for the webinterface. By default, this is set to *default*.\n* `node['pyload']['webinterface']['prefix']` - Specifies the path where all files of the webinterface are located. By default, the webinterface files are stored in the install directory, which means that this is set to *nil*.\n\n## Recipes\n\n### default\n\nThis is the only recipe which should be included either in your nodes `run_list` or by using `include_recipe` in your wrapper cookbook. The recipe will create the specified user and group for pyload and includes all other recipes of this cookbook (see below).\n\n### config\n\nThis recipe sets up the config directory as specified in `node['pyload']['conf_dir']` which includes creating the required folders and placing necessary configuration files.\n\n### install\n\nThis recipe does a number of things to install Pyload. This includes the following\n\n* create the install directory as specified in `node['pyload']['install_dir']`\n* create the configuration directory as specified in `node['pyload']['conf_dir']`\n* create the download directory as specified in `node['pyload']['download_dir']`\n* create the pid file directory (run directory) as specified in `node['pyload']['pid_dir']`\n* create the logging directory as specified in `node['pyload']['log_dir']`\n* clone Pyload source code from the [official Pyload Git repository](https://github.com/pyload/pyload) and checkout the version tag or branch as specified by `node['pyload']['version']` (default will be the latest *stable* branch)\n* perform a system check, to check if Pyload is able to run by using the [*systemCheck.py*](https://github.com/pyload/pyload/blob/stable/systemCheck.py) script in the source code\n* create symbolic links to */usr/bin* for all Pyload executables ([pyLoadCli](https://github.com/pyload/pyload/blob/stable/pyLoadCli.py), [pyLoadCore](https://github.com/pyload/pyload/blob/stable/pyLoadCore.py), [pyLoadGui](https://github.com/pyload/pyload/blob/stable/pyLoadGui.py)), to allow running Pyload directly from bash as command\n\n#### Note for OpenSUSE and derivatives:\n\nOn OpenSUSE and derivatives, the install recipe will need to execute a fix for starting Pyload as it fails to start due to overwritten `find` function. This fix will add the line `origfind.func_globals['find'] = origfind` to file `node['pyload']['install_dir']/module/common/pylgettext.py` by commenting it out. See issue [#2755](https://github.com/pyload/pyload/issues/2577) of Pyload repository, as this fix was suggested by Pyload team.\n\nIf you encounter issues in Pyload functionality, because of this fix, you can comment the line `origfind.func_globals['find'] = origfind` from file `node['pyload']['install_dir']/module/common/pylgettext.py` and disable the execution of the fix in this cookbook. This can be done by overwriting the attribute `node['pyload']['use_fix']` with value *false* (by default *true*).\n\n### packages\n\nThis will install all packages regarding your systems platform type, as specified in `node['pyload']['packages']`.\n\n### service\n\nThis recipe includes one of the `pyload::INIT_STYLE_service` recipes based on the attribute `node['pyload']['init_style']`, which is set regarding your target platform. The individual service recipes can be included directly too, if required. The supported init systems are\n\n* `bsd` - uses the rc.d init script included in this cookbook, supported on FreeBSD only.\n* `init` - uses the Sys-V-Init script included in this cookbook, supported on Debian and Red Hat Enterprise Linux (RHEL) family distributions.\n* `upstart` - uses the Sys-V-Init script included in this cookbook, as Upstart script in this cookbook is not supported.\n* `systemd` - sets up the service under SystemD. Supported on SystemD based platforms.\n\nIf the init system cannot be determined by this cookbook (f.e. unsupported platform) or any other desriptor is specified, there will be no init system script created from this cookbook.\n\n## Usage\n\nUsing this cookbook is relatively straight forward. Either put the default recipe (`pyload::default`) in a nodes `run_list` or include it in a your wrapper cookbook using `include_recipe`. Change the attributes as you need them, but in most cases no change will be required.\n\n## Development\n\nPlease see the [Contributing](https://github.com/gridtec/cookbook-pyload/blob/master/CONTRIBUTING.md) and [Testing](https://github.com/gridtec/cookbook-pyload/blob/master/TESTING.md) Guidelines.\n\n## Frequently Asked Questions\n\n### Which Pyload versions are able to be installed by this cookbook?\n\nYou are able to install any Pyload version which is available in the [official Pyload Git repository](https://github.com/pyload/pyload). You will just need to specify the appropriate version in `node['pyload']['version']` attribute. You are also able to install latest *stable* branch version, using `stable` identifier, which is set as default.\n\n### What packages are installed by this cookbook?\n\nThis cookbook will install various packages during its execution by using the target platforms package manager. Thereby lots of these packages represent required and optional dependencies of Pyload. They are defined in `node['pyload']['packages']` attribute and will be determined by this cookbook on its own as there may be differences in package names on various target platforms. To illustrate this differences, we provide the following matrix to give a short overview of these different package names.\n\n| Package           | Arch                   | Debian/Ubuntu              | Fedora                | RHEL/CentOS           | SUSE/openSUSE         | FreeBSD            |\n|-------------------|------------------------|----------------------------|-----------------------|-----------------------|-----------------------|--------------------|\n| git               | git                    | git                        | git                   | git                   | git                   | git                |\n| curl              | curl                   | curl                       | curl                  | curl                  | curl                  | curl               |\n| openssl           | openssl                | openssl                    | openssl               | openssl               | openssl               | openssl            |\n| python            | python2                | python                     | python                | python                | python                | python27           |\n| beaker            | python2-beaker         | python-beaker              | python-beaker         | python-beaker         | python-Beaker         | py27-beaker        |\n| BeautifulSoup4    | python2-beautifulsoup4 | python-bs4                 | python-beautifulsoup4 | python-beautifulsoup4 | python-beautifulsoup4 | py27-beautifulsoup |\n| pycrypto          | python2-crypto         | python-crypto              | python-crypto (<= 23)<br/>python2-crypto (>= 24) | python-crypto (<= 6)<br/>python2-crypto (>= 7) | python-pycrypto | py27-pycrypto |\n| python-django     | python2-django         | python-django              | python-django (<= 23)<br/>python2-django (>= 24) | Django(<= 6)<br/>python-django (>= 7) | python-django | py27-django19\n| python-feedparser | python2-feedparser     | python-feedparser          | python-feedparser     | python-feedparser     | python-feedparser     | py27-feedparser    |\n| python-flup       | python2-flup           | python-flup                | python-flup           | python-flup           | python-flup           | py27-flup          |\n| python-html5lib   | python2-html5lib       | python-html5lib            | python-html5lib       | python-html5lib       | python-html5lib       | py27-html5lib      |\n| python-imaging    | python2-pillow         | python-imaging             | python-pillow (<= 24)<br/>python2-pillow (>= 25) | python-imaging (<= 6)<br/>python-pillow (>= 7) | python-imaging (<= 13.1)<br/>python-Pillow (>= 13.2) | py27-pillow |\n| jinja2            | python2-jinja          | python-jinja2              | python-jinja2 (<= 23)<br/>python2-jinja2 (>= 24) | python-jinja2 | python-Jinja2 | py27-Jinja2 |\n| pycurl            | python2-pycurl         | python-pycurl              | python-pycurl         | python-pycurl         | python-pycurl         | py27-pycurl        |\n| pyOpenSSL         | python2-pyopenssl      | python-openssl             | pyOpenSSL             | pyOpenSSL             | python-pyOpenSSL      | py27-openssl       |\n| pyqt4             | python2-pyqt4          | python-qt4                 | PyQt4                 | PyQt4                 | python-qt4            | py27-qt4           |\n| simplejson        | python2-simplejson     | python-simplejson          | python-simplejson (<= 24)<br/>python2-simplejson (>= 25) | python-simplejson (<= 6)<br/>python2-simplejson (>= 7) | python-simplejson     | py27-simplejson    |\n| thrift            | thrift                 | python-thrift (>= 8/14.04) | python-thrift         | python-thrift (>=7)   | python-thrift         | py27-thrift        |\n| ossp-js           | js                     | libmozjs185-1.0 (<= 7/12.04)<br/>libmozjs-24-bin (>= 8/14.04) | js | js    | js<br/>python-python-spidermonkey | spidermonkey24 |\n| rhino             | rhino                  | rhino                      | rhino                 | rhino                 | rhino                 | rhino              |\n| tesseract         | tesseract<br/>gocr | tesseract-ocr<br/>tesseract-ocr-eng<br/>gocr | tesseract<br/>gocr | tesseract | tesseract<br/>gocr | tesseract<br/>tesseract-data<br/>gocr |\n| sqlite3           |                        |                            |                       |                       |                       | py27-sqlite3       |\n\nMore information on required and optional dependencies of Pyload can be found in the official Pyloads project [README](https://github.com/pyload/pyload/blob/stable/README).\n\n### How is this cookbook used without the Chef Server, f.e. to just install Pyload on the system?\n\nTo execute this cookbook without the Chef Server, you could use Chef Client local mode. First install the [latest Chef Client version](https://downloads.chef.io/chef) for your platform. Next clone the latest release from this cookbooks Git repository and copy it to the folder `cookbooks/pyload`. This is the directory layout required by the Chef Client. Last but not least, execute the following command, to install Pyload with Chef using the following command.\n\n```bash\nsudo chef-client -z -o pyload\n```\n\nThats it, the cookbook should now be executed by the Chef Client. After it has been successfully finished, Pyload should be installed on your system.\n\n### Why does this cookbook doesn't use Python PIP to install all dependencies for Pyload?\n\nWe thought about that, but we really do not need Python packages in a virtualenv but system-wide and we definitly can use the latest version of Python packages as no specific version is needed, so we decided in the end to use the systems package manager only. We could use Python PIP by just including the [poise-python](https://github.com/poise/poise-python) cookbook, as it provides a custom resource for installing packages using pip.\n\nIf you already have Python PIP installed on your system and you really depend on using it, you may want to set the `node['pyload']['packages']` attribute to *nil* which disables package install of this cookbook completely, but this will require you to take care that each required Pyload dependency is installed.\n\nHowever, in future time it might be necessary to use Python PIP to get the transparency for each platform, if we are not able to determine dependency package names for each platform anymore. Moreover, if the community wants us to install dependencies using Python PIP and that this is seen as an improvement of this cookbook, feel free to create an issue for that to let us know.\n\n### Why is a package installed by this cookbook not found on RHEL and its derivatives?\n\nOn RHEL and derivatives, it is required to install 3rd party repositories as base repositories do no include every required package. Either put [yum](https://github.com/chef-cookbooks/yum) and [yum-epel](https://github.com/chef-cookbooks/yum-epel) cookbooks in your `run_list` or include them by using `include_recipe` in your wrapper cookbook.\n\n### Why does this cookbook does not provide an Upstart config on Upstart enabled platforms?\n\nOn Upstart enabled platforms, we will just add a Sys-V-Init script and no Upstart configuration.\n\n### Why are there no unpacking software installed by the cookbook, such as `unzip` or `unrar`?\n\nWe do not install unpacking software such as `unzip` or `unrar`, because on many platforms these are non-free. If you depend on using ist, please install it manually using your platforms package manager. On some platforms, such as RHEL and derivatives, it may be required to add extra repositories to allow the platforms package manager to find it.\n\n### Does this cookbook generate a SSL certificates for me?\n\nNo. This is not the intend of this cookbook. You need to create your own SSL certificates either in your wrapper cookbook or manually on your node and configure this cookbook where this certificates can be found on the system.\n\nSSL certificate can be manually created for example by executing\n\n```bash\n  openssl genrsa 1024 > ssl.key openssl req -new -key ssl.key -out ssl.csr openssl req -days 36500 -x509 -key ssl.key -in ssl.csr > ssl.crt\n```\n\n### I want to execute this cookbooks tests. What do I need to do?\n\nWe have provided an information file, so see [TESTING.md](https://github.com/gridtec/cookbook-pyload/blob/master/TESTING.md) where you can find information on how to test this cookbook. We also suggest, that you have a look at [Travis CI](https://travis-ci.org/gridtec/cookbook-pyload), to see all tests we are currently executing to test this cookbook.\n\n### I want to contribute. What do I need to do?\n\nThank you, that you want to help us out. Please see [CONTRIBUTING.md](https://github.com/gridtec/cookbook-pyload/blob/master/CONTRIBUTING.md) for more information on contributing to this project.\n\n## License & Authors\n\n* Author:: [Gridtec](http://www.gridtec.at/) ([projects@gridtec.at](mailto:projects@gridtec.at))\n\n```\nCopyright 2016, Gridtec\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n   http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n```\n\n<!---\n## TODO\n* possibility to configure each plugin\n* extensions from git should be automatically added\n--->\n","maintainer":"Gridtec","maintainer_email":"projects@gridtec.at","license":"Apache 2.0","platforms":{"debian":">= 0.0.0","ubuntu":">= 0.0.0","centos":">= 0.0.0","redhat":">= 0.0.0","fedora":">= 0.0.0","suse":">= 0.0.0","opensuse":">= 0.0.0","arch":">= 0.0.0","freebsd":">= 0.0.0"},"dependencies":{},"recommendations":{},"suggestions":{},"conflicting":{},"providing":{},"replacing":{},"attributes":{},"groupings":{},"recipes":{}}