{"name":"strongSwan-base","description":"Installs/Configures a strongSwan VPN","long_description":"# strongSwan-base chef cookbook\n\n## Overview\n\n`strongSwan-base` and it's accompanying suite of dependant and recommended cookbooks is \nthe new direction we have decided upon for the future of our strongSwan offering. This \ncookbook is intended to allow the creation of a fully-functional VPN endpoint within \nan Amazon VPC.\n\n## Some Important Notes\n\nWhen reading/adjusting any StrongSwan configurations, remember these important words:\n\n**```  left is local to the machine it's stated on; right is remote in the same manner  ```**\n\nSo, on the server side, left is local to the server and on the client side, left is local to \nthat client. Remembering this will save you many a headache as you navigate the tangled web \nof information available for setting up a properly secured VPN with optimal compatibility. \nThe [strongSwan wiki](https://wiki.strongswan.org/projects/strongswan/wiki/UserDocumentation) \nis an excellent source of data, however, I wouldn't let that keep me from checking for any other \navailable information on configuring my particular use case.\n\n## Requirements\n\nAll code from the original strongswan cookbook has been split out into three seperate \ncookbooks to better follow best practices. The three cookbooks included in this new\nsuite have been (re)named as follows:\n\n- required to build a minimally functional VPN endpoint\n  - `strongSwan-base`       - sets up a basic StrongSwan server and accompanying networks.\n  - `strongSwan-scenarios`  - one idempotent location for all available and active scenarios.\n- recommended if you want full functionality of your VPN\n  - `strongSwan-pki`        - allows generation of a simplyCA server and certificate/key \ngeneration, distribution and revocation.\n","maintainer":"Jerry Jackson","maintainer_email":"jerry.jackson@acommitteeoflunatics.com","license":"All Rights Reserved","platforms":{"amazon":">= 0.0.0","centos":">= 6.0","debian":">= 7.0","fedora":">= 19.0","oracle":">= 6.0","redhat":">= 6.0","ubuntu":">= 14.04"},"dependencies":{"route53":">= 0.0.0","yum-epel":">= 0.0.0"},"recommendations":{},"suggestions":{},"conflicting":{},"providing":{},"replacing":{},"attributes":{},"groupings":{},"recipes":{},"version":"0.2.7"}